package stringAPI;

public class ExampleCharSequence {
}

/*
-----------------------------------------------------------------------------------------------------------------------
• IntStream codePoints() 8
    Возвращает поток всех кодовых точек исходной символьной строки в Юникоде.

• char charAt(int index)
    Возвращает кодовую единицу по заданному индексу.

• int length()
    Возвращает сведения об общем количестве кодовых единиц в данной последовательности.

• Char Sequence subsequence (int startlndex, int endlndex)
    Возвращает последовательность типа CharSequence, состоящую только из тех кодовых единиц, которые хранятся в пределах
    от startlndex до endlndex - 1.

• String toString()
    Возвращает символьную строку, состоящую только из тех кодовых единиц, которые входят в данную последовательность.
-----------------------------------------------------------------------------------------------------------------------
*/
