/**
 * OSGi (Open Services Gateway Initiative) — спецификация динамической модульной системы и сервисной платформы для
 * Java-приложений, разрабатываемая консорциумом OSGi Alliance. Спецификации дают модель для построения приложения из
 * компонентов, связанных вместе посредством сервисов[1]. Суть заключается в возможности переинсталлировать динамически
 * компоненты и составные части приложения без необходимости останавливать и перезапускать его.
 * <p>
 * Круг применений данной спецификации довольно широк: изначально разрабатывалась для создания встроенных систем (в
 * частности, для автомобилей BMW, также в разработке спецификации активно участвует Siemens), но сейчас на базе OSGi
 * строят многофункциональные автономные настольные приложения (например, Eclipse SDK) и корпоративные системы.
 * <p>
 * OSGi Alliance, ранее известная как Open Services Gateway initiative (инициатива доступа к открытым службам) — организация
 * открытых стандартов (open Standards Development Organization — SDO). В течение последних нескольких лет она разрабатывала
 * основанную на Java сервисную платформу OSGi (также известна как The Dynamic Module System for Java), которая могла
 * управляться удаленно. Основная часть этой разработки — фреймворк (каркас), который определяет модель жизненного цикла
 * приложения и служебного реестра.
 */
package OSGi;