package Examples.SWT_Standard_Widget_Toolkit;

public class Example_SWT_StandardWidgetToolkit {
}

/*
-----------------------------------------------------------------------------------------------------------------------
SWT — альтернатива AWT и Swing (Sun Microsystems) для разработчиков, желающих получить привычный внешний вид программы в
данной операционной системе. Использование SWT делает Java-приложение более эффективным, но снижает независимость от
операционной системы и оборудования, требует ручного освобождения ресурсов и в некоторой степени нарушает Sun-концепцию
платформы Java.
-----------------------------------------------------------------------------------------------------------------------
*/
