package multithreading;

public class ExampleThreadSleep {
    public static void main(String[] args) {

    }
}

/*
----------------------------------------------------------------------------------------------------------------------
Ttread.sleep() kohda lozitsa spat to ne otpyskaet monitor hde on bil vuzvan.
----------------------------------------------------------------------------------------------------------------------
•static void sleep(long m illis)
	Переходит в состояние ожидания на заданное число миллисекунд.
		Параметры: millis Количество миллисекунд ожидания
----------------------------------------------------------------------------------------------------------------------
*/
