package multithreading;

public class ExampleThread_UncaughtExceptionHandler {

    public static void main(String[] args) {

    }

}

/*
-------------------------------------------------------------------------------------------------------------------------------
•void uncaughtException (Thread t, Throwable e)
	Определяется для протоколирования специального отчета по завершении потока исполнения с не­ обрабатываемым исключением.
			Параметры: t:  Поток исполнения, который был завершен
						   с необрабатываемым исключением
					   е:  Объект необрабатываемого исключения
-------------------------------------------------------------------------------------------------------------------------------
*/
