package multithreading;

public class ExampleConcurrentSkipListSet {

    public static void main(String[] args) {

    }

}

/*
---------------------------------------------------------------------------------------------------------------------
•ConcurrentSkipListSet<E> ()
•ConcurrentSkipListSet<E> (Comparator^ super E> coznp)
	Конструируют отсортированное множество, безопасно доступное из многих потоков исполнения.
	Первый конструктор требует, чтобы элементы м н о ж еа в а относились к классу, реализующему ин­
	терфейс Comparable.
---------------------------------------------------------------------------------------------------------------------
*/