package multithreading;

public class ExampleArrayBlockingQueue {

    public static void main(String[] args) {

    }

}

/*
---------------------------------------------------------------------------------------------------------------
•ArrayBlockingQueue(int capacity)
•ArrayBlockingQueue(int capacity, boolean fair)
	Конструируют блокирующую очередь заданной емкости с установленным правилом равноправия
	блокировки, реализованную в виде циклического массива.
---------------------------------------------------------------------------------------------------------------
*/
