package Examples.Swing;

public class ExampleWindowStateListener {
}

/*
----------------------------------------------------------------------------------------------------------------------
НА ЗАМЕТКУ! Если требуется проверить, было ли окно развернуто до максимальных размеров, следует установить класс
WindowStateListener и переопределить метод windowstateChanged().
----------------------------------------------------------------------------------------------------------------------
•void windowStateChanged (WindowEvent event)
    Вызывается после того, как окно было полностью развернуто, свернуто или восстановлено до нормальных размеров.
----------------------------------------------------------------------------------------------------------------------
*/
