package Examples.Swing;

public class ExampleJOptionPane {
    public static void main(String[] args) {

    }
}

/*
----------------------------------------------------------------------------------------------------------------------
static void showMessageDialog(Component parent, Object mesage)
    Отображает диалоговое окно с подсказкой сообщений и кнопкой ОК . Это диалоговое окно распо­
    лагается по центру родительского компонента, обозначаемого параметром parent. Если же пара­
    метр parent принимает пустое значение null, диалоговое окно располагается по центру экрана.
----------------------------------------------------------------------------------------------------------------------
*/
