package Swing;

public class ExampleMouseEvent {

    public static void main(String[] args) {

    }

}

/*
----------------------------------------------------------------------------------------------------------------------------
•int getX()
•int getY()
•Point getPoint()
	Возвращают горизонтальную (x) и вертикальную (у) координаты или точку, в которой наступило со­
	бытие. Отсчет производится от левого верхнего угла компонента, являющегося источником события.
	
•int getClickCount()
	Возвращает количество последовательных щелчков кнопкой мыши, связанных с данным событи­ем. 
	(Промежуток времени, в пределах которого подсчитываются щелчки, зависит от операционной системы.) 
----------------------------------------------------------------------------------------------------------------------------
*/
