package Examples.Swing;

public class ExampleWindowEvent {
}

/*
-----------------------------------------------------------------------------------------------------------------------
•int getNewState() 1.4
•int getOldState() 1.4
        Возвращают новое или прежнее состояние окна при наступлении события, связанного с изменением его состояния.
        Возвращаемое целое значение может быть одним из следующих:
                        Frame.NORMAL
                        Frame.ICONIFIED
                        Frame.MAXIMIZEDJIORIZ
                        Frame.МАХMIZED_VERT
                        Frame.MAXIMIZED BOTH
-----------------------------------------------------------------------------------------------------------------------
*/
