package IO;

public class ExampleBufferedWriter {
    public static void main(String[] args) {
//--------------------------------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------------------------------
    }
}

/*
----------------------------------------------------------------------------------------------------------------------
Класс Bu fferedWri t e r является производным от класса Wr i t e r и буферизует
выводимые данные. Применяя класс B u fArgInt fe redWri t e r , можно повысить произво­
дительность за счет снижения количества операций физической записи в устройство вывода.
У класса Buffe redW r i ter имеются два конструктора:
ВufferedWriter (Writer no'l'oж .вuвода)
ВufferedWriter (Wri ter nо!l'ож = .вuвода , int раsиер_ буфера)
В первой форме конструктора создается буферизованный поток вывода, ис­
пользующий буфер размером, выбираемым по умолчанию. А во второй форме за­
дается конкретный ра змер_ буфер а .

----------------------------------------------------------------------------------------------------------------------
*/