package Examples.java_util;

public class ExampleTimeZone {
    public static void main(String[] args) {
//--------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------
    }
}


/*
----------------------------------------------------------------------------------------------------------------------
Еще одним, имеющим отношение ко времени является класс T ime Zone . Он
позволяет оперировать временем с учетом часовых поясов, смещенных относи·
тельно среднего времени по Гринвичу (GMT) , называемого также универсальнш
скоординированн'ЫМ временем ( UCT) . В классе T ime Zone учитывается также летнее
время. В нем поддерживается только конструктор по умолчанию.
----------------------------------------------------------------------------------------------------------------------
*/