package awt_abstract_window_toolkit;

public class ExamplePoint2D {
    public static void main(String[] args) {

    }
}

/*
-----------------------------------------------------------------------------------------------------------------------
СОВЕТ. Класс Point2D очень удобен. Обращение с объектами класса Point2D в большей степени соответствует объектно-ориентированному
принципу программирования, чем оперирование отдельными координатами х и у . Многие конструкторы и методы принимают параметры,
имеющие тип Point2D. И при всякой возможности рекомендуется пользоваться именно этими объектами, поскольку они делают
вычисления геометрических форм более понятными.
-----------------------------------------------------------------------------------------------------------------------
*/