package awt_abstract_window_toolkit;

public class ExampleWindow {
    public static void main(String[] args) {

    }
}

/*
-----------------------------------------------------------------------------------------------------------------------
•void toFront()
    Выводит окно поверх других окон на экране.

•void toBack()
    Размещает данное окно позади всех остальных окон, выведенных на экран, соответственно переупорядочивая их.

•boolean isLocationByPlatform() 5.0
•void setLocationByPlatform(boolean b ) 5.0
    Получают или устанавливают свойство locationByPlatform. Если это свойство установлено до того, как отобразилось данное
    окно, то подходящее расположение выбирает платформа.

•void pack()
    Изменяет размеры данного окна, принимая во внимание предпочтительные размеры его компонентов.
-----------------------------------------------------------------------------------------------------------------------
*/