package awt_abstract_window_toolkit;

public class ExampleRectangularShape {
}

/*
----------------------------------------------------------------------------------------------------------------------
•double getCenterX()
•double getCenterY()
•double getMinX()
•double getMinY()
•double getMaxX()
•double getMaxY()
        Возвращают координаты центра, наименьшую и наибольшую координату х и у описанного прямоугольника.

•double getWidth()
•double getHeight()
        Возвращают ширину и высоту описанного прямоугольника.

•double getX()
•double getY()
        Возвращают координаты х и у левого верхнего угла описанного прямоугольника.
----------------------------------------------------------------------------------------------------------------------
*/
