package awt_abstract_window_toolkit;

public class ExampleLineMetries {
    public static void main(String[] args) {

    }
}

/*
----------------------------------------------------------------------------------------------------------------------
•float getAscent()
        Получает подъем шрифта — расстояние от базовой линии до верхушек прописных букв.

•float getDescent()
        Получает спуск — расстояние от базовой линии до подстрочных элементов букв.

•float getLeading()
        Получает интерлиньяж — расстояние от нижнего края предыдущей строки до верхнего края следующей строки.

•float getHeight()
        Получает общую высоту шрифта — расстояние между двумя базовыми линиями текста, равное сум­
        ме спуска, интерлиньяжа и подъема.
----------------------------------------------------------------------------------------------------------------------
*/