package Examples.OOP;

public class ExampleImenovanueBlokiIMetki {
    public static void main(String[] args) {
//--------------------------------------------------------------------------------------------------------------------
        /*Нечто малоиспользуемое, однако всё так же компилируемое:*/
//        twoCycle:
//        {
//            System.out.println(3);
//            while (true) {
//                System.out.println(1);
//                while (true) {
//                    System.out.println(2);
//                    break twoCycle;
//                }
//            }
//        }
        /*Здесь также вспоминается факт о зарезервированных словах const и goto, которые являются ключевыми,
        однако использовать их нельзя. Ещё метки дают забавный эффект. Код ниже отлично компилируется (отлично громко
        сказано, компилятор такое без ворчания не пропустит).*/
//--------------------------------------------------------------------------------------------------------------------
        System.out.println("Hello World!");
        http:
//Phi.Lho.free.fr

        System.out.println();
//        System.exit(0);
//--------------------------------------------------------------------------------------------------------------------
    }
}


