package Examples.OOP;

public class ExampleClass {
    public static void main(String[] args) {

    }
}

/*
----------------------------------------------------------------------------------------------------------------------
Любой класс в Java может иметь только один суперкласс, но в то же время любой класс может реализовывать несколько
интерфейсов. Это позволяет максимально гиб­ко определять поведение класса.
----------------------------------------------------------------------------------------------------------------------
*/
