package applet;

public class ExampleAppletContext {

    public static void main(String[] args) {

    }

}

/*
----------------------------------------------------------------------------------------------------------------------------------
Для взаимодействия с браузером аплет вызывает метод getAppletContext(), который возвращает объект, реализующий интерфейс 
AppletContext. Конкрет­ную реализацию интерфейса AppletContext можно считать средством взаимодей­ ствия аплета и загрузившего его 
браузера. В дополнение к методам getAudioClip() и get Image() в интерфейсе AppletContext имеется несколько полезных методов,
----------------------------------------------------------------------------------------------------------------------------------
*/
