package Examples.Reflection_API;

public class ExampleReflectionParameterizedType {
}

/*
-----------------------------------------------------------------------------------------------------------------------
•Type getRawType ()
    Получает базовый тип для данного параметризованного типа.

•Туре [] getActualTypeArguments ()
    Получает параметр типа, с которым был объявлен данный параметризованный тип.

•Type getOwnerType()
    Получает тип внешнего класса, если данный тип — внутренний, или же пустое значение null,
    если это тип верхнего уровня.
-----------------------------------------------------------------------------------------------------------------------
*/
