package Examples.Reflection_API;

public class ExampleInvocationHandler {
}

/*
----------------------------------------------------------------------------------------------------------------------
•Object invoke(Object proxy, Method method, Object[] args)
    Этот метод определяется с целью задать действие, которое должно быть выполнено при вызове какого-нибудь метода для
    прокси-объекта.
----------------------------------------------------------------------------------------------------------------------
*/
