package Examples.Reflection_API;

public class ExampleReflectionTypeVariable {

}

/*
-----------------------------------------------------------------------------------------------------------------------
•String getName()
    Получает имя переменной типа.

•Туре[] getBounds()
    Получает ограничения на подкласс для данной переменной типа или массив нулевой длины, если ограничения на переменную отсутствуют.
-----------------------------------------------------------------------------------------------------------------------
*/
