package Examples.Reflection_API;

public class ExampleReflectionAccesibleObject {
    public static void main(String[] args) {

    }
}

/*
----------------------------------------------------------------------------------------------------------------------
•void setAccessible (boolean flag)
    Устанавливает признак доступности заданного объекта рефлексии. Логическое значение true па­
    раметра flag обозначает, что проверка доступа к компонентам языка Java отменена и закрытые
    свойства объекта теперь доступны для выборки и установки.

•boolean isAccessible()
    Получает значение признака доступности заданного объекта рефлексии.

•static void setAccessible (AccessibleObject [] array , boolean flag)
    Удобен для установки признака доступности массива объектов.
----------------------------------------------------------------------------------------------------------------------
*/