package Examples.Reflection_API;

public class ExampleReflectionWildcardType {
}

/*
-----------------------------------------------------------------------------------------------------------------------
•Type[] getUpperBounds()
    Получает для данной переменной типа ограничения на подкласс, определяемые оператором extends, или массив нулевой длины,
    если ограничения на подкласс отсутствуют.

•Туре[] getLowerBounds()
    Получает для данной переменной типа ограничения на суперкласс, определяемые оператором super, или массив нулевой длины,
    если ограничения на суперкласс отсутствуют.
-----------------------------------------------------------------------------------------------------------------------
*/
