package JAR_JavaArchive;

public class ExampleJAR {

    public static void main(String[] args) {

    }

}

/*
-----------------------------------------------------------------------------------------------------------------------------
СОВЕТ. В качестве альтернативы сжатию в формате ZIP применяется алгоритм раск200 как бо­лее эффективный для сжатия файлов классов. 
По заявлениям компании Oracle этот алгоритм обеспеч ивает степень сжатия файлов классов до 90%. Подробнее об этом алгоритме можно 
уз­нать по адресу http://docs.oracle.eom/javase/l.5.0/docs/guide/deployment/deployment-guide/pack200.html.
-----------------------------------------------------------------------------------------------------------------------------
*/
