package JAR_JavaArchive;

public class ExampelManifest {

}

/*
-----------------------------------------------------------------------------------------------------------------------------------
HA ЗАМЕТКУ! Подробнее о форматах архивных JAR-файлов, а также файлов манифестов можно узнать по адресу 
http://docs.oracle.cоm/javase/8/docs/technotes/guides/jar.
-----------------------------------------------------------------------------------------------------------------------------------
ВНИМАНИЕ! Последняя строка в манифесте должна оканчиваться символом перевода строки. В противном случае манифест не будет 
прочитан правильно. Весьма распространена ошибка, когда создается текстовый файл с единственной строкой Main-Class, но без 
ограничителя строки.
-----------------------------------------------------------------------------------------------------------------------------------
*/
