package JFC_JavaFoundationClasses;

public class Example_JFC_JavaFoundationClassses {
    public static void main(String[] args) {

    }
}

/*
-----------------------------------------------------------------------------------------------------------------------
Swing является частью библиотеки классов Java Foundation Classes (JFC). Полный комплект JFC огромен и содержит намного
больше, чем набор инструментальных средств Swing для разработки ГПИ. В состав JFC входят не только компоненты Swing, но
и прикладные программные интерфейсы API Aдля специальных возможностей, двухмерной графики и перетаскивания.
-----------------------------------------------------------------------------------------------------------------------
*/