package java_net;

public class ExampleURI {
}

/*
----------------------------------------------------------------------------------------------------------------------
Класс URI инкапсулирует универсалъный идентифи:катор ресурса (URI) , очень по­
хожий на URL. На самом деле URL является подмножеством URI. Если URI обо­
значает стандартный способ идентификации ресурсов, то URL описывает также
доступ к ресурсу.
----------------------------------------------------------------------------------------------------------------------
*/
