package character_encoding;

/**
 * Потоки ввода-вывода представляют собой последовательности байтов, но
 * зачастую приходится обрабатывать текст, т.е. последовательности символов. В
 * таком случае имеет значение, каким образом символы кодируются в байты.
 * Для кодирования символов в Java применяется стандарт, называемый
 * Юникодом (Unicode). Каждый символ, или так называемая кодовая точка, представлен
 * в Юникоде 21-разрядным целым числом. Имеются разные кодировки символов —
 * способы упаковки 21-разрядных целых чисел в байты.
 */
public class ExampleUnicode {
    public static void main(String[] args) {
    }
}
